app/Http/Controllers/Auth/LoginController.php

select * from `sm_background_settings` where (`is_default` = 1 and `title` = 'Login Background') limit 1
select `role_id`, `email` from `users` where `role_id` in (1, 2, 3, 4, 5, 6, 7, 8)
---
    public function loginFormTwo()
    {


        if (Schema::hasTable('users')) {
            $login_background = SmBackgroundSetting::where([['is_default', 1], ['title', 'Login Background']])->first();
            if (empty($login_background)) {
                $css = "background: url(" . url('public/backEnd/login2/img/login-bg.png') . ")  no-repeat center; background-size: cover; ";
            } else {
                if (!empty($login_background->image)) {
                    $css = "background: url('" . url($login_background->image) . "')  no-repeat center;  background-size: cover;";

                } else {
                    $css = "background:" . $login_background->color;
                }
            }
            if (moduleStatusCheck('Saas') == TRUE) {

                $schools = SmSchool::where('id', '!=', 1)->orderBy('school_name', 'asc')->get();
                $sch = SmSchool::find(1);

                $users = User::where('role_id', 1)->whereIn('school_id', [1, 2, 3, 4])->get();
                $user1 = $users->where('school_id', 1)->first();
                $user2 = $users->where('school_id', 2)->first();
                $user3 = $users->where('school_id', 3)->first();
                $user4 = $users->where('school_id', 4)->first();
                return view('saas::auth.saas_login', compact('schools', 'sch', 'css', 'user1', 'user2', 'user3', 'user4'));
            } else {
                $users = User::whereIn('role_id', [1,2,3,4, 5, 6,7,8])->select('role_id','email')->get();