app/SmFeesAssign.php

select * from `sm_fees_payments` where `active_status` = 1 and `fees_type_id` = 7 and `student_id` = 814
---
    public static function feesPayment($type_id, $student_id){
        try {
            $payments = SmFeesPayment::where('active_status',1)->where('fees_type_id', $type_id)->where('student_id', $student_id)->get();