app/SmNotification.php

    public static function notifications(){

			$user = Auth()->user();
			if ($user) {
				if($user->role_id == 2){
					return SmNotification::where('user_id', Auth::id())->where('role_id', 2)->where('is_read', 0)->orderBy('id','DESC')->get();
---
select * from `sm_notifications` where `user_id` = 1258 and `role_id` = 2 and `is_read` = 0 order by `id` desc