app/Http/Controllers/Student/SmFeesController.php

select * from `sm_payment_methhods` where `active_status` = 1 and `school_id` = 1 limit 1
select * from `sm_fees_assigns` where `student_id` = 814 and `school_id` = 1
select * from `sm_fees_assign_discounts` where `student_id` = 814 and `school_id` = 1
select * from `sm_payment_gateway_settings` where `gateway_name` = 'Paystack' and `school_id` = 1 limit 1
select * from `sm_payment_methhods` where `method` = 'Bank' and `school_id` = 1 limit 1
select * from `sm_payment_methhods` where `method` = 'Cheque' and `school_id` = 1 limit 1
---
    public function studentFees()
    {
        try {
            $student = Auth::user()->student;

            $payment_gateway = SmPaymentMethhod::where('active_status', 1)->where('school_id', Auth::user()->school_id)->first();

            $fees_assigneds = SmFeesAssign::where('student_id', $student->id)->where('school_id', Auth::user()->school_id)->get();
            $fees_discounts = SmFeesAssignDiscount::where('student_id', $student->id)->where('school_id', Auth::user()->school_id)->get();

            $applied_discount = [];
            foreach ($fees_discounts as $fees_discount) {
                $fees_payment = SmFeesPayment::select('fees_discount_id')->where('active_status', 1)->where('fees_discount_id', $fees_discount->id)->where('school_id', Auth::user()->school_id)->first();
                if (isset($fees_payment->fees_discount_id)) {
                    $applied_discount[] = $fees_payment->fees_discount_id;
                }
            }

            $paystack_info = DB::table('sm_payment_gateway_settings')->where('gateway_name', 'Paystack')->where('school_id', Auth::user()->school_id)->first();


            $data['bank_info'] = SmPaymentMethhod::where('method', 'Bank')->where('school_id', Auth::user()->school_id)->first();
            $data['cheque_info'] = SmPaymentMethhod::where('method', 'Cheque')->where('school_id', Auth::user()->school_id)->first();

select * from `sm_fees_payments` where `student_id` = '814'
select * from `sm_fees_types` where `sm_fees_types`.`id` in (196)
---
    public function studentPaidFees($id)
    {
        try {
            $fees_payments = SmFeesPayment::with(['studentInfo','feesType'])->where('student_id', $id)->get();