app/Traits/UserChatMethods.php

    public function getAvatarUrlAttribute()
    {
        if ($this->role_id){
            if($this->role_id == 2){
                $student = SmStudent::whereUserId($this->id)->first();
---
select * from `sm_students` where `user_id` = 1258 limit 1

    public function blockedByMe()
    {
        return BlockUser::where('block_by', auth()->id())->where('block_to', $this->id)->exists();
---
select exists(select * from `chat_block_users` where `block_by` = 1258 and `block_to` = 1258) as `exists`