app/Helpers/Helper.php

select * from `users` where `role_id` = 1 limit 1
---
    function getUserLanguage(){
         if (Auth::check()) {
           return userLanguage();
        }else{
            $user=User::where('role_id',1)->first();

select * from `sm_general_settings` where `school_id` = 1 limit 1
---
    function generalSetting()
    {
        session()->forget('generalSetting');
        if (session()->has('generalSetting')) {
            return session()->get('generalSetting');
        } else {
            $generalSetting = Auth::check() ? SmGeneralSettings::where('school_id',Auth::user()->school_id)->first() : SmGeneralSettings::first() ;

select `student_photo` from `sm_students` where `user_id` = 1258 limit 1
---
    function profile(){
        if (session()->has('profile')) {
            return session()->get('profile');
        } else {
            if(Auth::user()->role_id == 2){
                $profile =  SmStudent::where('user_id', Auth::id())->first('student_photo');